src/ut10_old/Documents/КадровоеПеремещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>КадровоеПеремещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КадровыйУчетСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПеревода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПеревода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПеревода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтделПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтделПеревода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ut10_old/InformationRegisters/КадровыйУчетСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КадровыйУчетСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ut10_old/Documents/КадровоеПеремещение/Ext/ObjectModule.bsl
// Заполняет реквизиты значениями по умолчанию
//
// Параметры: 
//  ПараметрОбъектКопирования	- содержкит ссылку на документ копирования в случае, 
//								  если новый документ создается копированием.
//  ПараметрОснование			- содержкит ссылку на документ-основание в случае, 
//								  если новый документ создается на основании другого.
//
Процедура ИнициализироватьНовыйДокумент(ПараметрОбъектКопирования, ПараметрОснование) Экспорт

	#Если Клиент Или ВнешнееСоединение Тогда
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"), , , ПараметрОбъектКопирования, ПараметрОснование);
	#КонецЕсли

КонецПроцедуры // ИнициализироватьНовыйДокумент()	

Процедура ОбработкаПроведения(Отказ, Режим)
	// Проверяем наличие кадровых событий по сотруднику в указанную дату документа (созданных другими документами)
	// Если таковые имеются, отменяем проведение документа с сообщением пользователю об ошибке.
	Если РегистрыСведений.КадровыйУчетСотрудников.НаличиеКадровыхСобытийНаДату(Ссылка, Дата, Новый Структура("Организация,Сотрудник", Организация, Сотрудник)) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// регистр КадровыйУчетСотрудников
	Движения.КадровыйУчетСотрудников.Записывать = Истина;
	Движения.КадровыйУчетСотрудников.Очистить();
	Движение = Движения.КадровыйУчетСотрудников.Добавить();
	Движение.Период = НачалоДня(ДатаПеревода);
	Движение.Организация = Организация;        
	Движение.Сотрудник = Сотрудник;
	Движение.Состояние = Состояние;
	Движение.Должность = ДолжностьПеревода;
	Движение.Подразделение = ПодразделениеПеревода;
	Если ОтделПеревода<>"" Тогда	
		ЗаписатьВСправочникНаСервере();
	КонецЕсли;
КонецПроцедуры

//&НаСервере
Процедура ЗаписатьВСправочникНаСервере()
	Элемент = Справочники.ФизическиеЛица.НайтиПоНаименованию(ЭтотОбъект.Сотрудник);
	ЭлементСправочник=Элемент.ПолучитьОбъект();
	ЭлементСправочник.Отдел=ОтделПеревода;
	ЭлементСправочник.Записать();
КонецПроцедуры

Процедура ЗаполнитьТекущиеДанныеКадровогоУчета() Экспорт
	Значения = РегистрыСведений.КадровыйУчетСотрудников.ПолучитьПоследнее(Дата, Новый Структура("Организация, Сотрудник", Организация, Сотрудник));
	
	ЭтотОбъект.ПодразделениеПеремещения = Значения.Подразделение;
	ЭтотОбъект.ДолжностьПеремещения = Значения.Должность;
	ЭтотОбъект.Состояние = Значения.Состояние;
	
	ЭлементСправочника = Справочники.ФизическиеЛица.НайтиПоНаименованию(ЭтотОбъект.Сотрудник); 
	ЭтотОбъект.ОтделПеремещения = ЭлементСправочника.Отдел;
КонецПроцедуры
